[
  {
    "titre": "Développeur Full Stack Java/React - Senior",
    "description": "Nous recherchons un développeur full stack expérimenté pour rejoindre notre équipe de développement. Vous serez responsable du développement d'applications web modernes utilisant Java Spring Boot côté backend et React côté frontend. Vous travaillerez dans un environnement agile et collaboratif, en étroite collaboration avec les équipes UX/UI et DevOps.",
    "localisation": "Tunis, Tunisie",
    "entreprise": "TechCorp Tunisia",
    "typeContrat": "CDI",
    "salaire": 2500.0,
    "experience": 5,
    "dateExpiration": "2025-08-08T23:59:59",
    "competencesTechniques": "Java 17, Spring Boot 3.0, Spring Security, JPA/Hibernate, PostgreSQL, React 18, TypeScript, Redux Toolkit, REST APIs, GraphQL, Maven, Git, JUnit, Mockito",
    "competencesTransversales": "Leadership technique, Mentorat junior, Communication efficace, Résolution de problèmes complexes, Travail en équipe agile, Gestion de projet",
    "experienceMinRequise": 4,
    "experienceMaxSouhaitee": 8,
    "niveauEtudeMin": "BAC_PLUS_5",
    "languesRequises": "Français (natif), Anglais (courant B2+), Arabe (natif)",
    "secteurActivite": "Technologie de l'information",
    "missionPrincipale": "Développer et maintenir des applications web full stack robustes et scalables en utilisant les technologies Java et React",
    "responsabilites": "Conception et développement d'APIs REST, Développement d'interfaces utilisateur réactives, Optimisation des performances, Code review et mentorat, Participation à l'architecture technique, Tests unitaires et d'intégration",
    "outilsTechnologies": "IntelliJ IDEA, VS Code, Docker, Jenkins, SonarQube, Postman, Figma, Jira, Confluence, AWS/Azure",
    "typePoste": "TECHNIQUE",
    "modaliteTravail": "HYBRIDE",
    "niveauSeniorite": "SENIOR",
    "motsClesGeneres": "développement web, full stack, Java, React, Spring Boot, PostgreSQL, API REST, architecture, performance, agile, DevOps, CI/CD"
  },
  {
    "titre": "Data Scientist - Machine Learning & IA",
    "description": "Rejoignez notre équipe Data Science pour développer des modèles d'intelligence artificielle innovants. Vous travaillerez sur des projets de machine learning, de NLP et de computer vision pour améliorer nos produits et services. Une opportunité unique de travailler avec des données massives et des technologies de pointe.",
    "localisation": "Sfax, Tunisie",
    "entreprise": "DataTech Solutions",
    "typeContrat": "CDI",
    "salaire": 3200.0,
    "experience": 3,
    "dateExpiration": "2025-09-15T23:59:59",
    "competencesTechniques": "Python, TensorFlow, PyTorch, Scikit-learn, Pandas, NumPy, Jupyter, SQL, NoSQL, Apache Spark, MLflow, Docker, Kubernetes, AWS SageMaker, OpenAI API, Hugging Face",
    "competencesTransversales": "Pensée analytique, Créativité, Communication de résultats complexes, Curiosité scientifique, Collaboration interdisciplinaire, Apprentissage continu",
    "experienceMinRequise": 2,
    "experienceMaxSouhaitee": 6,
    "niveauEtudeMin": "BAC_PLUS_5",
    "languesRequises": "Français (courant), Anglais (avancé C1), Arabe (bon niveau)",
    "secteurActivite": "Intelligence artificielle et Data Science",
    "missionPrincipale": "Développer et déployer des modèles de machine learning pour résoudre des problèmes business complexes",
    "responsabilites": "Analyse exploratoire des données, Développement de modèles ML/DL, Évaluation et optimisation des modèles, Déploiement en production, Recherche et veille technologique, Présentation des résultats aux stakeholders",
    "outilsTechnologies": "PyCharm, Jupyter Lab, MLflow, Apache Airflow, Grafana, Tableau, Power BI, Git, Linux, AWS/GCP",
    "typePoste": "TECHNIQUE",
    "modaliteTravail": "REMOTE",
    "niveauSeniorite": "CONFIRME",
    "motsClesGeneres": "machine learning, intelligence artificielle, Python, TensorFlow, data science, NLP, computer vision, deep learning, big data, cloud computing, MLOps"
  },
  {
    "titre": "Chef de Projet Digital - Transformation Numérique",
    "description": "Nous recherchons un chef de projet expérimenté pour piloter nos projets de transformation numérique. Vous serez responsable de la planification, de l'exécution et du suivi de projets technologiques complexes, en collaboration avec des équipes techniques et business.",
    "localisation": "Sousse, Tunisie",
    "entreprise": "Digital Transformation Consulting",
    "typeContrat": "CDI",
    "salaire": 2800.0,
    "experience": 6,
    "dateExpiration": "2025-08-20T23:59:59",
    "competencesTechniques": "Gestion de projet Agile/Scrum, PRINCE2, PMP, Jira, Confluence, MS Project, Tableau de bord KPI, Analyse business, UML, Bases de données, Architecture SI",
    "competencesTransversales": "Leadership, Gestion d'équipe, Communication interpersonnelle, Négociation, Résolution de conflits, Adaptabilité, Vision stratégique, Gestion du stress",
    "experienceMinRequise": 5,
    "experienceMaxSouhaitee": 10,
    "niveauEtudeMin": "BAC_PLUS_5",
    "languesRequises": "Français (excellent), Anglais (courant B2), Arabe (bon niveau)",
    "secteurActivite": "Conseil en transformation numérique",
    "missionPrincipale": "Piloter et coordonner les projets de transformation numérique de bout en bout",
    "responsabilites": "Planification et suivi de projets, Gestion des risques et budget, Coordination des équipes, Reporting aux parties prenantes, Gestion du changement, Assurance qualité",
    "outilsTechnologies": "Jira, Confluence, MS Project, Slack, Teams, Miro, Figma, Power BI, Excel avancé, SharePoint",
    "typePoste": "MANAGEMENT",
    "modaliteTravail": "HYBRIDE",
    "niveauSeniorite": "SENIOR",
    "motsClesGeneres": "gestion de projet, transformation numérique, Agile, Scrum, leadership, coordination, planification, digital, innovation, changement organisationnel"
  },
  {
    "titre": "Développeur Mobile Flutter - Applications Cross-Platform",
    "description": "Développez des applications mobiles innovantes avec Flutter ! Rejoignez notre équipe mobile pour créer des applications iOS et Android performantes. Vous travaillerez sur des projets variés allant des applications e-commerce aux applications métier.",
    "localisation": "Monastir, Tunisie",
    "entreprise": "MobileApp Studio",
    "typeContrat": "CDI",
    "salaire": 2200.0,
    "experience": 3,
    "dateExpiration": "2025-09-01T23:59:59",
    "competencesTechniques": "Flutter, Dart, Android SDK, iOS SDK, Firebase, SQLite, REST APIs, JSON, Git, Provider/Riverpod, Bloc pattern, Material Design, Cupertino",
    "competencesTransversales": "Créativité, Attention aux détails, Travail autonome, Collaboration avec designers, Adaptabilité technologique, Résolution de problèmes UX",
    "experienceMinRequise": 2,
    "experienceMaxSouhaitee": 5,
    "niveauEtudeMin": "BAC_PLUS_3",
    "languesRequises": "Français (courant), Anglais (intermédiaire B1), Arabe (natif)",
    "secteurActivite": "Développement mobile",
    "missionPrincipale": "Développer des applications mobiles cross-platform performantes et user-friendly avec Flutter",
    "responsabilites": "Développement d'applications Flutter, Intégration d'APIs, Optimisation des performances, Tests et debugging, Déploiement sur stores, Maintenance et évolutions",
    "outilsTechnologies": "Android Studio, VS Code, Xcode, Firebase Console, Postman, Figma, Git, Fastlane, Play Console, App Store Connect",
    "typePoste": "TECHNIQUE",
    "modaliteTravail": "PRESENTIEL",
    "niveauSeniorite": "CONFIRME",
    "motsClesGeneres": "développement mobile, Flutter, Dart, cross-platform, iOS, Android, Firebase, API, UI/UX, performance, mobile apps"
  },
  {
    "titre": "Analyste Cybersécurité - SOC Security Operations Center",
    "description": "Rejoignez notre équipe de cybersécurité pour protéger nos infrastructures et données. Vous serez responsable de la surveillance, de la détection et de la réponse aux incidents de sécurité. Une expertise technique et une capacité d'analyse approfondie sont essentielles.",
    "localisation": "Ariana, Tunisie",
    "entreprise": "SecureIT Tunisia",
    "typeContrat": "CDI",
    "salaire": 2600.0,
    "experience": 4,
    "dateExpiration": "2025-08-25T23:59:59",
    "competencesTechniques": "SIEM (Splunk, QRadar), Analyse de logs, Forensique numérique, Penetration testing, Wireshark, Nmap, Burp Suite, Python scripting, Linux, Windows Server, Firewalls, IDS/IPS",
    "competencesTransversales": "Vigilance constante, Analyse critique, Réactivité, Travail sous pression, Communication d'incidents, Apprentissage continu, Éthique professionnelle",
    "experienceMinRequise": 3,
    "experienceMaxSouhaitee": 7,
    "niveauEtudeMin": "BAC_PLUS_5",
    "languesRequises": "Français (courant), Anglais (avancé pour documentation technique), Arabe (bon niveau)",
    "secteurActivite": "Cybersécurité",
    "missionPrincipale": "Assurer la surveillance et la protection des systèmes d'information contre les menaces cybernétiques",
    "responsabilites": "Monitoring des systèmes de sécurité, Analyse des incidents, Réponse aux alertes, Investigations forensiques, Mise à jour des règles de sécurité, Reporting de sécurité",
    "outilsTechnologies": "Splunk, QRadar, Wireshark, Nessus, Metasploit, Kali Linux, VMware, OSINT tools, Threat intelligence platforms",
    "typePoste": "TECHNIQUE",
    "modaliteTravail": "PRESENTIEL",
    "niveauSeniorite": "CONFIRME",
    "motsClesGeneres": "cybersécurité, SOC, SIEM, incident response, penetration testing, forensique, monitoring, threat hunting, sécurité informatique, analyse de logs"
  },
  {
    "titre": "Architecte Cloud AWS - Infrastructure & DevOps",
    "description": "Concevez et implémentez des architectures cloud scalables et sécurisées sur AWS. Vous accompagnerez les équipes dans leur migration vers le cloud et optimiserez les coûts d'infrastructure. Une expertise approfondie d'AWS et des pratiques DevOps est requise.",
    "localisation": "Tunis, Tunisie",
    "entreprise": "CloudFirst Solutions",
    "typeContrat": "CDI",
    "salaire": 3800.0,
    "experience": 7,
    "dateExpiration": "2025-09-10T23:59:59",
    "competencesTechniques": "AWS (EC2, S3, RDS, Lambda, ECS, EKS), Terraform, CloudFormation, Docker, Kubernetes, Jenkins, GitLab CI/CD, Monitoring (CloudWatch, Prometheus), Ansible, Python, Bash",
    "competencesTransversales": "Vision architecturale, Leadership technique, Mentorat d'équipe, Communication avec management, Optimisation des coûts, Innovation technologique, Gestion de projets complexes",
    "experienceMinRequise": 5,
    "experienceMaxSouhaitee": 12,
    "niveauEtudeMin": "BAC_PLUS_5",
    "languesRequises": "Français (excellent), Anglais (avancé C1 pour certifications), Arabe (courant)",
    "secteurActivite": "Cloud Computing et DevOps",
    "missionPrincipale": "Concevoir et implémenter des architectures cloud AWS robustes, scalables et cost-effective",
    "responsabilites": "Conception d'architectures cloud, Migration d'applications, Optimisation des performances, Mise en place CI/CD, Sécurisation des environnements, Formation des équipes",
    "outilsTechnologies": "AWS Console, Terraform, Docker, Kubernetes, Jenkins, GitLab, Prometheus, Grafana, Ansible, VS Code, Terminal",
    "typePoste": "TECHNIQUE",
    "modaliteTravail": "HYBRIDE",
    "niveauSeniorite": "EXPERT",
    "motsClesGeneres": "cloud computing, AWS, DevOps, architecture, Terraform, Kubernetes, CI/CD, scalabilité, sécurité cloud, optimisation, migration, infrastructure as code"
  },
  {
    "titre": "UX/UI Designer - Expérience Utilisateur Mobile et Web",
    "description": "Créez des expériences utilisateur exceptionnelles ! Nous recherchons un designer UX/UI passionné pour concevoir des interfaces intuitives et esthétiques. Vous travaillerez en étroite collaboration avec les équipes produit et développement pour créer des solutions centrées utilisateur.",
    "localisation": "Nabeul, Tunisie",
    "entreprise": "Design & Innovation Lab",
    "typeContrat": "CDI",
    "salaire": 2100.0,
    "experience": 3,
    "dateExpiration": "2025-08-30T23:59:59",
    "competencesTechniques": "Figma, Adobe Creative Suite (Photoshop, Illustrator, XD), Sketch, InVision, Marvel, Principle, HTML/CSS basics, Design System, Responsive Design, Accessibility (WCAG)",
    "competencesTransversales": "Créativité, Empathie utilisateur, Communication visuelle, Collaboration interdisciplinaire, Esprit critique, Adaptabilité, Présentation d'idées, Gestion du feedback",
    "experienceMinRequise": 2,
    "experienceMaxSouhaitee": 6,
    "niveauEtudeMin": "BAC_PLUS_3",
    "languesRequises": "Français (courant), Anglais (intermédiaire pour veille), Arabe (natif)",
    "secteurActivite": "Design et Expérience Utilisateur",
    "missionPrincipale": "Concevoir des interfaces utilisateur intuitives et engageantes pour les applications web et mobile",
    "responsabilites": "Recherche utilisateur, Wireframing et prototypage, Design d'interfaces, Tests utilisateur, Création de design systems, Collaboration avec les développeurs",
    "outilsTechnologies": "Figma, Adobe Creative Suite, Sketch, InVision, Miro, Notion, Zoom, Slack, Google Analytics, Hotjar",
    "typePoste": "TECHNIQUE",
    "modaliteTravail": "HYBRIDE",
    "niveauSeniorite": "CONFIRME",
    "motsClesGeneres": "UX design, UI design, expérience utilisateur, interface, prototypage, design thinking, user research, wireframing, design system, accessibilité, mobile design"
  },
  {
    "titre": "Consultant Business Intelligence - Analyse de Données",
    "description": "Transformez les données en insights business ! Rejoignez notre équipe BI pour concevoir et développer des solutions d'analyse de données. Vous aiderez les entreprises à prendre des décisions éclairées grâce à des tableaux de bord et des analyses pertinentes.",
    "localisation": "Gabès, Tunisie",
    "entreprise": "Business Intelligence Pro",
    "typeContrat": "CDI",
    "salaire": 2400.0,
    "experience": 4,
    "dateExpiration": "2025-09-05T23:59:59",
    "competencesTechniques": "Power BI, Tableau, QlikView, SQL avancé, T-SQL, Python, R, Excel VBA, SSAS, SSRS, SSIS, Data Warehouse, ETL, Azure Data Factory, PostgreSQL, Oracle",
    "competencesTransversales": "Analyse business, Communication de résultats, Storytelling avec données, Conseil client, Résolution de problèmes, Pensée analytique, Gestion de projet",
    "experienceMinRequise": 3,
    "experienceMaxSouhaitee": 8,
    "niveauEtudeMin": "BAC_PLUS_5",
    "languesRequises": "Français (excellent), Anglais (courant pour outils), Arabe (courant)",
    "secteurActivite": "Business Intelligence et Analytics",
    "missionPrincipale": "Développer des solutions BI pour transformer les données en insights business exploitables",
    "responsabilites": "Analyse des besoins business, Conception de data warehouse, Développement de rapports, Création de tableaux de bord, Formation utilisateurs, Optimisation des performances",
    "outilsTechnologies": "Power BI Desktop, SQL Server Management Studio, Visual Studio, Python IDEs, Tableau Desktop, Excel, Azure Portal, Git",
    "typePoste": "TECHNIQUE",
    "modaliteTravail": "HYBRIDE",
    "niveauSeniorite": "CONFIRME",
    "motsClesGeneres": "business intelligence, analyse de données, Power BI, SQL, data warehouse, ETL, tableaux de bord, KPI, reporting, analytics, data visualization"
  }
]

